import 'package:flutter_day9/models/data_model.dart';

class Famous extends Data {
  Famous(String? name, List<String>? related) : super(name, related);

  static List<Famous> instances = [
    Famous("تامر حسني", ["عمرو دياب", "حمادة هلال", "محمود الليثي"]),
    Famous("مني زكي", ["غادة عبد الرازق", "ياسمين عبد العزيز", "منة شلبي"]),
    Famous("أمينة خليل", ["ياسمين رئبس", "ياسمين صبري", "أسماء جلال"]),
    Famous("أحمد مكي", ["أحمد السقا", "أحمد عز", "احمد حلمي"]),
    Famous("عمرو دياب", ["تامر حسني", "حمادة هلال", "محمود الليثي"]),
    Famous("حمادة هلال", ["عمرو دياب", "تامر حسني", "محمود الليثي"]),
    Famous("محمود الليثي", ["عمرو دياب", "حمادة هلال", "تامر حسني"]),
    Famous("غادة عبد الرازق", ["مني زكي", "ياسمين عبد العزيز", "منة شلبي"]),
    Famous("ياسمين عبد العزيز", ["غادة عبد الرازق", "مني زكي", "منة شلبي"]),
    Famous("منة شلبي", ["غادة عبد الرازق", "ياسمين عبد العزيز", "مني زكي"]),
    Famous("ياسمين رئبس", ["أمينة خليل", "ياسمين صبري", "أسماء جلال"]),
    Famous("ياسمين صبري", ["ياسمين رئبس", "أمينة خليل", "أسماء جلال"]),
    Famous("أسماء جلال", ["ياسمين رئبس", "ياسمين صبري", "أمينة خليل"]),
    Famous("أحمد السقا", ["أحمد مكي", "أحمد عز", "احمد حلمي"]),
    Famous("أحمد عز", ["أحمد السقا", "أحمد مكي", "احمد حلمي"]),
    Famous("احمد حلمي", ["أحمد السقا", "أحمد عز", "أحمد مكي"]),
  ];
}
