import 'package:flutter_day9/models/data_model.dart';

class Players extends Data {
  Players(String? name, List<String>? related) : super(name, related);

  static List<Players> instances = [
    Players("أبو تريكة", ["محمد بركات", "عماد متعب", "وليد سليمان"]),
    Players("شيكابالا", ["حازم امام", "أشرف بن شرقي", "طارق حامد"]),
    Players("وائل جمعة", ["الونش", "أحمد حجازي", "محمد عبد الشافي"]),
    Players("حسني عبد ربه", ["محمد زيدان", "محمد شوقي", "عمرو زكي"]),
    Players("محمد النني", ["فرجاني ساسي", "وليد ازارو", "أحمد فتحي"]),
    Players("عصام الحضري", ["أحمد الشناوي", "نادر السيد", "شريف إكرامي"]),
    Players("فلافيو", ["أليو ديانج", "جلبرتو", "ماليك ايفونا"]),
    Players("محمد بركات", ["أبو تريكة", "عماد متعب", "وليد سليمان"]),
    Players("عماد متعب", ["محمد بركات", "أبو تريكة", "وليد سليمان"]),
    Players("وليد سليمان", ["محمد بركات", "عماد متعب", "أبو تريكة"]),
    Players("حازم امام", ["شيكابالا", "أشرف بن شرقي", "طارق حامد"]),
    Players("أشرف بن شرقي", ["حازم امام", "شيكابالا", "طارق حامد"]),
    Players("طارق حامد", ["حازم امام", "أشرف بن شرقي", "شيكابالا"]),
    Players("الونش", ["وائل جمعة", "أحمد حجازي", "محمد عبد الشافي"]),
    Players("أحمد حجازي", ["الونش", "وائل جمعة", "محمد عبد الشافي"]),
    Players("محمد عبد الشافي", ["الونش", "أحمد حجازي", "وائل جمعة"]),
    Players("محمد زيدان", ["حسني عبد ربه", "محمد شوقي", "عمرو زكي"]),
    Players("محمد شوقي", ["محمد زيدان", "حسني عبد ربه", "عمرو زكي"]),
    Players("عمرو زكي", ["محمد زيدان", "محمد شوقي", "حسني عبد ربه"]),
    Players("فرجاني ساسي", ["محمد النني", "وليد ازارو", "أحمد فتحي"]),
    Players("وليد ازارو", ["فرجاني ساسي", "محمد النني", "أحمد فتحي"]),
    Players("أحمد فتحي", ["فرجاني ساسي", "وليد ازارو", "محمد النني"]),
    Players("أحمد الشناوي", ["عصام الحضري", "نادر السيد", "شريف إكرامي"]),
    Players("نادر السيد", ["أحمد الشناوي", "عصام الحضري", "شريف إكرامي"]),
    Players("شريف إكرامي", ["أحمد الشناوي", "نادر السيد", "عصام الحضري"]),
    Players("أليو ديانج", ["فلافيو", "جلبرتو", "ماليك ايفونا"]),
    Players("جلبرتو", ["أليو ديانج", "فلافيو", "ماليك ايفونا"]),
    Players("ماليك ايفونا", ["أليو ديانج", "جلبرتو", "فلافيو"]),
  ];
}
